import React, { Component } from 'react';
import Articalsfilm from './../Film/Articalsfilm';
import {Text, View} from 'react-native';
import FontAwesome5 from "react-native-vector-icons/FontAwesome5";

export default class Homefilm extends Component {
    static navigationOptions={
        title: 'سینما سی‌نما',
        headerStyle:{
            backgroundColor: '#d35400',
        },
        headerTitleStyle: {
            fontFamily:'IRANSansMobile_Light',
            fontWeight:"200",
            flex: 1,
            textAlign: 'center'
        },
        headerRight: <View style={{marginRight:20}}>
            <FontAwesome5 name={'film'} color={'#2d3436'} size={25} />
        </View>

    }
    componentWillMount(){
        this.setState({
            articalsfilm : [
                {
                    title: ' انی هال',

                    imageUrl : {uri:'http://theretroset.com/wp-content/uploads/2016/04/AHallprint.jpg'},
                    body : '        استنلی کوبریک (به انگلیسی: Stanley Kubrick) (زادهٔ ۲۶ ژوئیهٔ ۱۹۲۸- درگذشته ۷ مارس ۱۹۹۹) کارگردان و تهیه‌کنندهٔ یهودی‌تبار آمریکایی بود. بیشتر فیلم‌های کوبریک اقتباسات ادبی هستند. فیلم‌های کوبریک معمولاً جنجالی و همین‌طور مورد ستایش منتقدان واقع شده‌اند. کوبریک به دقیق بودن و به نمایش درآوردن همه جزئیات دقیق در فیلم‌هایش معروف بود. به همین علت روش او در فیلمسازی کند و طولانی بوده، تا آنجا که گاهی میان دو فیلم او سال‌ها وقفه می‌افتاده‌است. او در طول ۴۸ سال فعالیت در حیطه کارگردانی تنها ۱۳ فیلم بلند ساخت. سبک‌های گوناگون فیلم‌هایش و انزوای او چه در روش فیلمسازی و چه در مورد شخصیت فردی وی، او را مشهور ساخته‌است. استنلی کوبریک یکی از معدود کارگردانان کمالگرا در تاریخ سینما به‌شمار می‌آید. کوبریک جزء معدود کارگردان‌هایی بود که همواره در انتخاب فیلمنامه ریسک می‌کرد. او فیلم‌های خود را در ژانرهای گوناگونی می‌ساخت.'
                },
                {
                    title: ' رستگاری در شاوشانک',
                    imageUrl: {uri:'https://i.pinimg.com/236x/f8/ca/37/f8ca37d083428fad83dd270daaa0ff3f--the-shawshank-redemption-morgan-freeman.jpg'},
                    body: '     وودی آلن (به انگلیسی: Woody Allen) ‏(۱ دسامبر ۱۹۳۵)، کمدین، بازیگر، کارگردان، نویسنده و موسیقی‌دان آمریکایی است. آلن فعالیت حرفه‌ای خود را به عنوان یک نویسنده کتاب‌های طنز و سپس یک کمدین روی صحنه آغاز کرد و سپس در دههٔ ۶۰ میلادی فعالیت فیلم‌سازی خود را آغاز کرد. وی ۱۹ بار نامزد اسکار و چهار بار برنده آن شده‌است که این جوایز شامل یک اسکار بهترین کارگردانی و سه جایزه اسکار بهترین فیلم‌نامه غیراقتباسی است.'
                },
                {
                    title: ' سرگیجه',
                    imageUrl: {uri:'https://images-na.ssl-images-amazon.com/images/I/51nANfGOIZL.jpg'},
                    body: '     فرانسیس فورد کوپولا (به انگلیسی: Francis Ford Coppola) ‏(۷ آوریل ۱۹۳۹، دیترویت، میشیگان) یکی از مشهورترین کارگردانان و تهیه‌کنندگان آمریکایی ایتالیایی‌تبار سینمای هالیوود است. او به جز کارگردانی، فیلمنامه می‌نویسد، شراب تجارت می‌کند، مجله چاپ می‌کند و صاحب هتل نیز هست. او را بیشتر به خاطر ساخت سه‌گانه پدرخوانده می‌شناسند که سینمای گانگستری را متحول کرد. وی برنده پنج اسکار شامل یک اسکار بهترین فیلم، یک اسکار بهترین کارگردانی، دو جایزه اسکار بهترین فیلم‌نامه اقتباسی و یک جایزه اسکار بهترین فیلم‌نامه غیراقتباسی شده‌است. کوپولا همچنین برنده چهار گلدن گلوب و دو نخل طلای کن (برای فیلم‌های مکالمه و اینک آخرالزمان) شده‌است.'
                },
                {
                    title: ' گاو خشمگین' +
                        '',
                    imageUrl: {uri:'https://i.pinimg.com/originals/8a/48/d2/8a48d2fc92a6fa007ff6d43d1dc77bbf.jpg'},
                    body: '     هاوارد وینچستر هاکس (به انگلیسی: Howard Winchester Hawks) (زاده ۳۰ مه ۱۸۹۶ - درگذشته ۲۶ دسامبر ۱۹۷۷) کارگردان، تهیه‌کننده و فیلم‌نامه‌نویس فیلم شهیر آمریکایی دوران طلایی هالیوود است.\n' +
                        '\n' +
                        '       هاکس از نظر اکثر منتقدین سینمایی از جمله کارگردانان مولف به‌شمار می‌رود که همواره امضای شخصی خود را در آثار سینمایی‌اش دارد. از آثار معروف این کارگردان بزرگ می توان فیلم های فاخری چون ریو براو، بزرگ کردن بچه، داشتن و نداشتن و هاتاری! نام برد.'
                },
                {
                    title: ' قصه‌های عامه‌پسند',
                    imageUrl: {uri:'https://cdn.shopify.com/s/files/1/1002/7150/products/pulpfiction_800x.jpg?v=1547187605'},
                    body: '     کوئِنتین جِروم تارانتینو (به انگلیسی: Quentin Jerome Tarantino) (زادهٔ ۲۷ مارس ۱۹۶۳ در ناکسویل، تنسی، ایالات متحدهٔ آمریکا) کارگردان، بازیگر و فیلمنامه‌نویس آمریکایی است که برندهٔ جایزهٔ نخل طلایی بهترین کارگردان، هنرپیشه و همچنین برندهٔ جایزهٔ اسکار بهترین فیلمنامه‌نویس است. وی در ابتدای دههٔ ۹۰ با ساخت فیلم‌هایی با ساختار غیرخطی و پست مدرن و به تصویر کشیدن خشونت تصنعی، به شهرت رسید. وی را کارگردان دی‌جی می‌نامند. دلیل این نام نیز بخاطر نحوه استفاده وی از موسیقی برای خلق صحنه‌های خاص در فیلم‌هایش است.\n' +
                        '\n' +
                        '       تارانتینو از همان ابتدا به هنر و صنعت سینما علاقه بسیاری داشت؛ وی در زمانی که مشغول یادگیری بازیگری بود، در یک مرکز اجاره فیلم (ویدئو کلوب) مشغول به کار بوده‌است. فعالیت تارانتیو در دهه ۱۹۸۰ و زمانی که فیلم آماتوری تولد بهترین دوستم را به نگارش درآورد و کارگردانی کرد، آغاز شد. نمایشنامه همین فیلم بود که پایه‌های شکل‌گیری نمایشنامه بعدی‌اش، یعنی عشق حقیقی را شکل داد. در اوایل دهه ۱۹۹۰ تارانتینو کار خود را به عنوان فیلم‌ساز مستقل آغاز کرد و فیلم سگ‌های انباری را ساخت. فارغ از نوع فیلم، مجله امپایر این فیلم را «خارق‌العاده‌ترین فیلم مستقل تمام اعصار» نامید. پیشرفت تارانتینو با ساخت فیلم بعدیش، داستان عامه‌پسند، در سال ۱۹۹۴ سرعت بیشتری به خود گرفت. این فیلم از نظر تجاری توانست موفقیت بسیاری کسب کند. این فیلم را نیز یکی از بهترین فیلم‌های تاریخ می‌دانند. فیلم بعدیش نیز فیلم جکی براون بود که از روی یک رمان ساخته شده بود.'
                },
                {
                    title: ' پدرخوانده' +
                        '',
                    imageUrl: {uri:'http://clipart-library.com/img/1752951.png'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' روانی' +
                        '',
                    imageUrl: {uri:'https://20ui41tp7v127j03rcnp97oh-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/joehumphreys_psycho700.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },

                {
                    title: ' درخت زندگی' +
                        '',
                    imageUrl: {uri:'https://images-na.ssl-images-amazon.com/images/I/51KF7hFDy6L.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' دکتر استرینج‌لاو',
                    imageUrl: {uri:'http://cdn.mutantspace.com/wp-content/uploads/2012/04/dr-strangelove-stanley-kubrick.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' تئورما' +
                        '',
                    imageUrl: {uri:'https://mindreels.files.wordpress.com/2015/04/futuristika_teorema_02.jpg?w=1160'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' 12 مرد خشمگین',
                    imageUrl: {uri:'http://www.metroactive.com/metro/03.26.08/gifs/DVD_12AngryMen.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' فارست گامپ' +
                        '',
                    imageUrl: {uri:'http://filmexodus.com/wp-content/uploads/2018/06/flat550x550075f.u6.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' لیست شیندلر' +
                        '',
                    imageUrl: {uri:'https://i.pinimg.com/236x/71/74/99/717499627dab01930f322912998468ca--film-poster-poster-art.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' قاره هفتم' +
                        '',
                    imageUrl: {uri:'https://upload.wikimedia.org/wikipedia/en/5/57/Dersiebentekontinent.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' سکوت بره‌ها' +
                        '',
                    imageUrl: {uri:'https://images-na.ssl-images-amazon.com/images/I/410VHPrwUPL.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' مرثیه‌ای برای یک رویا',
                    imageUrl: {uri:'https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/cf384347-9cf9-4d00-84b4-78c1d009f880/d70z77j-d27dbbb0-0dbd-4eb4-94e5-e6c0c82a8684.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcL2NmMzg0MzQ3LTljZjktNGQwMC04NGI0LTc4YzFkMDA5Zjg4MFwvZDcwejc3ai1kMjdkYmJiMC0wZGJkLTRlYjQtOTRlNS1lNmMwYzgyYTg2ODQuanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.CsImeoLD8p10nvnDUENi2sEKKb74dIK8JCrVrvvW-8o'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' بعدازظهر سگی' +
                        '',
                    imageUrl: {uri:'https://images-na.ssl-images-amazon.com/images/I/51wuIc9gWrL._SY445_.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' دیوانه از قفس پرید',
                    imageUrl: {uri:'https://i.pinimg.com/originals/6b/5f/01/6b5f015824ff4ef8edb5663e5f6e4fb2.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' همشهری کین' +
                        '',
                    imageUrl: {uri:'https://m.media-amazon.com/images/M/MV5BYjBiOTYxZWItMzdiZi00NjlkLWIzZTYtYmFhZjhiMTljOTdkXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' پرتقال کوکی' ,
                    imageUrl: {uri:'https://imgc.allpostersimages.com/img/print/u-g-F8SZ2T0.jpg?w=550&h=550&p=0'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' آواز در باران' +
                        '',
                    imageUrl: {uri:'http://naghdefarsi.com/wp-content/uploads/2013/03/1-Singin-in-the-Rain.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' راه‌های افتخار' ,
                    imageUrl: {uri:'https://upload.wikimedia.org/wikipedia/fa/thumb/b/bc/PathsOfGloryPoster.jpg/220px-PathsOfGloryPoster.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' راننده تاکسی' ,
                    imageUrl: {uri:'https://66.media.tumblr.com/af6cbd5434ae3cd49e0e789e628cbc37/tumblr_pdu4c8qDSl1x4ktmuo2_250.png'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' جاده' +
                        '',
                    imageUrl: {uri:'https://upload.wikimedia.org/wikipedia/en/thumb/0/03/La_Strada_Poster.jpg/220px-La_Strada_Poster.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' پنجره پشتی' +
                        '',
                    imageUrl: {uri:'https://m.media-amazon.com/images/M/MV5BNGUxYWM3M2MtMGM3Mi00ZmRiLWE0NGQtZjE5ODI2OTJhNTU0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' طعم گیلاس' +
                        '',
                    imageUrl: {uri:'https://upload.wikimedia.org/wikipedia/fa/thumb/d/d3/%D8%B7%D8%B9%D9%85_%DA%AF%DB%8C%D9%84%D8%A7%D8%B3.jpg/220px-%D8%B7%D8%B9%D9%85_%DA%AF%DB%8C%D9%84%D8%A7%D8%B3.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
                {
                    title: ' لا لا لند' +
                        '',
                    imageUrl: {uri:'https://render.fineartamerica.com/images/rendered/default/print/6.125/8.000/break/images/artworkimages/medium/1/la-la-land-movie-poster-dan-sproul.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },

            ]
        })

    }
    render(){
        return(
            <Articalsfilm navigation={this.props.navigation} articalsfilm={this.state.articalsfilm}/>
        )
    }
}
