import React, { Component } from 'react';
import Articals from './../components/Articals';
import {Text, View} from 'react-native';
import FontAwesome5 from "react-native-vector-icons/FontAwesome5";

export default class Home extends Component {
    static navigationOptions={
        title: 'سینما سی‌نما',
        headerStyle:{
            backgroundColor: '#bdc3c7',
        },
        headerTitleStyle: {
            fontFamily:'IRANSansMobile_Light',
            fontWeight:"200",
            flex: 1,
            textAlign: 'center'
        },
        headerRight: <View style={{marginRight:20}}>
            <FontAwesome5 name={'male'} color={'#2d3436'} size={25} />
        </View>

    }
    componentWillMount(){
        this.setState({
            articals : [
                {
                    Engtitle: 'Stanley Kubrik\n1928-1999',
                    title: ' استنلی کوبریک',
                    imageUrl : {uri:'https://cdn.zoomg.ir/2018/7/18502ce0-7c8a-47f7-a70c-32c827a73121.jpg'},
                    body : '        استنلی کوبریک (به انگلیسی: Stanley Kubrick) (زادهٔ ۲۶ ژوئیهٔ ۱۹۲۸- درگذشته ۷ مارس ۱۹۹۹) کارگردان و تهیه‌کنندهٔ یهودی‌تبار آمریکایی بود. بیشتر فیلم‌های کوبریک اقتباسات ادبی هستند. فیلم‌های کوبریک معمولاً جنجالی و همین‌طور مورد ستایش منتقدان واقع شده‌اند. کوبریک به دقیق بودن و به نمایش درآوردن همه جزئیات دقیق در فیلم‌هایش معروف بود. به همین علت روش او در فیلمسازی کند و طولانی بوده، تا آنجا که گاهی میان دو فیلم او سال‌ها وقفه می‌افتاده‌است. او در طول ۴۸ سال فعالیت در حیطه کارگردانی تنها ۱۳ فیلم بلند ساخت. سبک‌های گوناگون فیلم‌هایش و انزوای او چه در روش فیلمسازی و چه در مورد شخصیت فردی وی، او را مشهور ساخته‌است. استنلی کوبریک یکی از معدود کارگردانان کمالگرا در تاریخ سینما به‌شمار می‌آید. کوبریک جزء معدود کارگردان‌هایی بود که همواره در انتخاب فیلمنامه ریسک می‌کرد. او فیلم‌های خود را در ژانرهای گوناگونی می‌ساخت.'
                },
                {
                    Engtitle: 'Woody Allen\n1935-present',
                    title: ' وودی الن',
                    imageUrl: {uri:'http://www.gstatic.com/tv/thumb/persons/28/28_v9_ba.jpg'},
                    body: '     وودی آلن (به انگلیسی: Woody Allen) ‏(۱ دسامبر ۱۹۳۵)، کمدین، بازیگر، کارگردان، نویسنده و موسیقی‌دان آمریکایی است. آلن فعالیت حرفه‌ای خود را به عنوان یک نویسنده کتاب‌های طنز و سپس یک کمدین روی صحنه آغاز کرد و سپس در دههٔ ۶۰ میلادی فعالیت فیلم‌سازی خود را آغاز کرد. وی ۱۹ بار نامزد اسکار و چهار بار برنده آن شده‌است که این جوایز شامل یک اسکار بهترین کارگردانی و سه جایزه اسکار بهترین فیلم‌نامه غیراقتباسی است.'
                },
                {
                    Engtitle: 'Francis Ford Coppola\n1939-present',
                    title: ' فرانسیس فورد کاپولا',
                    imageUrl: {uri:'https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Francis_Ford_Coppola_2011_CC.jpg/220px-Francis_Ford_Coppola_2011_CC.jpg'},
                    body: '     فرانسیس فورد کوپولا (به انگلیسی: Francis Ford Coppola) ‏(۷ آوریل ۱۹۳۹، دیترویت، میشیگان) یکی از مشهورترین کارگردانان و تهیه‌کنندگان آمریکایی ایتالیایی‌تبار سینمای هالیوود است. او به جز کارگردانی، فیلمنامه می‌نویسد، شراب تجارت می‌کند، مجله چاپ می‌کند و صاحب هتل نیز هست. او را بیشتر به خاطر ساخت سه‌گانه پدرخوانده می‌شناسند که سینمای گانگستری را متحول کرد. وی برنده پنج اسکار شامل یک اسکار بهترین فیلم، یک اسکار بهترین کارگردانی، دو جایزه اسکار بهترین فیلم‌نامه اقتباسی و یک جایزه اسکار بهترین فیلم‌نامه غیراقتباسی شده‌است. کوپولا همچنین برنده چهار گلدن گلوب و دو نخل طلای کن (برای فیلم‌های مکالمه و اینک آخرالزمان) شده‌است.'
                },
                {
                    Engtitle: 'Howard Winchester Hawks\n1896-1977',
                    title: ' هاوارد هاکس',
                    imageUrl: {uri:'http://www.gstatic.com/tv/thumb/persons/26929/26929_v9_ba.jpg'},
                    body: '     هاوارد وینچستر هاکس (به انگلیسی: Howard Winchester Hawks) (زاده ۳۰ مه ۱۸۹۶ - درگذشته ۲۶ دسامبر ۱۹۷۷) کارگردان، تهیه‌کننده و فیلم‌نامه‌نویس فیلم شهیر آمریکایی دوران طلایی هالیوود است.\n' +
                        '\n' +
                        '       هاکس از نظر اکثر منتقدین سینمایی از جمله کارگردانان مولف به‌شمار می‌رود که همواره امضای شخصی خود را در آثار سینمایی‌اش دارد. از آثار معروف این کارگردان بزرگ می توان فیلم های فاخری چون ریو براو، بزرگ کردن بچه، داشتن و نداشتن و هاتاری! نام برد.'
                },
                {
                    Engtitle: 'Quentin Tarantino\n1963-present',
                    title: ' کوئنتین تارانتینو',
                    imageUrl: {uri:'https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Quentin_Tarantino_by_Gage_Skidmore.jpg/220px-Quentin_Tarantino_by_Gage_Skidmore.jpg'},
                    body: '     کوئِنتین جِروم تارانتینو (به انگلیسی: Quentin Jerome Tarantino) (زادهٔ ۲۷ مارس ۱۹۶۳ در ناکسویل، تنسی، ایالات متحدهٔ آمریکا) کارگردان، بازیگر و فیلمنامه‌نویس آمریکایی است که برندهٔ جایزهٔ نخل طلایی بهترین کارگردان، هنرپیشه و همچنین برندهٔ جایزهٔ اسکار بهترین فیلمنامه‌نویس است. وی در ابتدای دههٔ ۹۰ با ساخت فیلم‌هایی با ساختار غیرخطی و پست مدرن و به تصویر کشیدن خشونت تصنعی، به شهرت رسید. وی را کارگردان دی‌جی می‌نامند. دلیل این نام نیز بخاطر نحوه استفاده وی از موسیقی برای خلق صحنه‌های خاص در فیلم‌هایش است.\n' +
                        '\n' +
                        '       تارانتینو از همان ابتدا به هنر و صنعت سینما علاقه بسیاری داشت؛ وی در زمانی که مشغول یادگیری بازیگری بود، در یک مرکز اجاره فیلم (ویدئو کلوب) مشغول به کار بوده‌است. فعالیت تارانتیو در دهه ۱۹۸۰ و زمانی که فیلم آماتوری تولد بهترین دوستم را به نگارش درآورد و کارگردانی کرد، آغاز شد. نمایشنامه همین فیلم بود که پایه‌های شکل‌گیری نمایشنامه بعدی‌اش، یعنی عشق حقیقی را شکل داد. در اوایل دهه ۱۹۹۰ تارانتینو کار خود را به عنوان فیلم‌ساز مستقل آغاز کرد و فیلم سگ‌های انباری را ساخت. فارغ از نوع فیلم، مجله امپایر این فیلم را «خارق‌العاده‌ترین فیلم مستقل تمام اعصار» نامید. پیشرفت تارانتینو با ساخت فیلم بعدیش، داستان عامه‌پسند، در سال ۱۹۹۴ سرعت بیشتری به خود گرفت. این فیلم از نظر تجاری توانست موفقیت بسیاری کسب کند. این فیلم را نیز یکی از بهترین فیلم‌های تاریخ می‌دانند. فیلم بعدیش نیز فیلم جکی براون بود که از روی یک رمان ساخته شده بود.'
                },
                {
                    Engtitle: 'Martin Scorsese\n1942-present',
                    title: ' مارتین اسکورسیزی',
                    imageUrl: {uri:'https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Martin_Scorsese_by_David_Shankbone.jpg/220px-Martin_Scorsese_by_David_Shankbone.jpg'},
                    body: '     مارتین اسکورسیزی (به انگلیسی: Martin Scorsese)، کارگردان، فیلمنامه‌نویس، تهیه‌کننده، هنرپیشه و تاریخ‌دان ایتالیایی-آمریکایی فیلم و سینما است. این کارگردان شهیر سینمای آمریکا، عنوان دار تمامی جوایز معتبر سینمایی دنیا جایزه اسکار، جایزه گلدن گلوب، جایزه بفتا، جایزه انجمن اتحادیه کارگردانان آمریکا و البته جشنواره کن، جشنواره فیلم ونیز و انجمن‌های مهم مختلف منتقدین آمریکا و جهان و همچنین معروف‌ترین جایزه تلویزیونی آمریکا جایزه امی می‌باشد.'
                },
            ]
        })

    }
    render(){
        return(
            <Articals navigation={this.props.navigation} articals={this.state.articals}/>
        )
    }
}
